Repository: miurahr/translate-django-ja
Catalog: tm/django.tmx
Source language: en_us
Languages: ja

source: Note that the latest Django trunk may not always be stable. When developing against trunk, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
ja: 開発中の､最新の Django ではステーブルとは限りません｡トランクバージョンで開発を行う場合､ `Django の継続インテグレーションビルド`__ をチェックしてください｡これで､テストの失敗があなたのマシンだけのものか､ Django 公式のビルドによるものかが分かります｡各ビルドについてのリンクをクリックすれば､ "Configuration Matrix" という､ 各 Python のバージョン､ DB バックエンドに対応したテストの失敗を閲覧できます｡

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to :ref:`run the tests using a different database <running-unit-tests-settings>`.
ja: このチュートリアルや､各チケットで作業する際は､ SQLite のテストで十分です｡しかし可能 (か必要な場合は) :ref:`他のデータベースでテストを実行する <running-unit-tests-settings>` を参照してください｡

source: Writing some tests for your ticket
ja: チケットにテストを書く

source: In most cases, for a patch to be accepted into Django it has to include tests. For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on. A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed. For patches containing new features, you'll need to include tests which ensure that the new features are working correctly. They too should fail when the new feature is not present, and then pass once it has been implemented.
ja: 大抵の場合､ Django にアクセプトされるパッチはテストを含んでいます｡リグレッションテストを書くことで､ Django にバグを再混入していないと後に保証できます｡レグレッションテストは､バグが存在しているときに落ちるように書き､バグが修正された後にパスするように書かれるべきです｡新機能を含むパッチでは､その新機能が正しく動作すると保証するためにテストが必要です｡その際も同じように､新機能が無い際には落ち､実装されてから通るテストを書くべきです｡

source: A good way to do this is to write your new tests first, before making any changes to the code. This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches. After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet). If your new tests don't fail, you'll need to fix them so that they do. After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
ja: これをするには､コードに変更を加える前に先にテストを書くのが良いでしょう｡この開発手法は `テスト駆動開発`__ と呼ばれ､プロジェクト全体にも単一のパッチにも適応可能です｡テストを書いた後には､テストを走らせて確かに落ちることを確認します (バグ修正や昨日の追加はまだしてないので落ちます)｡ 新しいテストが落ちない場合は落ちるよう修正しましょう｡ともかく､バグが存在していようとも通るテストは将来バグが再発するのを防ぐのに､何の役にもたちません｡

source: Now for our hands-on example.
ja: ハンズオンでの例題

source: Writing some tests for ticket #17549
ja: チケット #17549 にテストを書いてみましょう

source: It's useful for URLField to give you a way to open the URL; otherwise you might as well use a CharField.
ja: URLField は URL を開けるようにするのに便利です; CharField を使ってもかまいません｡

source: In order to resolve this ticket, we'll add a ``render`` method to the ``AdminURLFieldWidget`` in order to display a clickable link above the input widget. Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
ja: このチケットを解決するには､ ``render`` メソッドを ``AdminURLFieldWidget`` に追加します｡ input ウィジェットの上にクリック可能なリンクをするようにします｡変更を加える前に､変更が正しく動作し､これからも動作し続けることを確認するためにテストをいくつか追加します｡

source: The new tests check to see that the ``render`` method we'll be adding works correctly in a couple different situations.
ja: 新しいテストでは ``render`` メソッドをチェックするもので､いくつかのシチュエーションで正しく動作することを確認します｡

source: If you've never had to deal with tests before, they can look a little hard to write at first glance. Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
ja: テストを書いたとこがない場合は､最初は難しく見えるかもしれません｡ですが実は､テスティングはプログラミングにおいて *とても* 重要なことです｡ここではテストについて詳細に紹介します｡

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
ja: Dive Into Python (Python初心者のための､オンラインの無料の本) では素晴らしい `初めてのユニットテスト`__ という章があります｡

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the `Python unittest documentation`__.
ja: Dive Into Python を読んだあと､もう少し情報が欲しい場合は `Python のユニットテスト`__ のドキュメントを参照してください｡

source: Running your new test
ja: 新しいテストを走らせる

source: Remember that we haven't actually made any modifications to ``AdminURLFieldWidget`` yet, so our tests are going to fail. Let's run all the tests in the ``model_forms_regress`` folder to make sure that's really what happens. From the command line, ``cd`` into the Django ``tests/`` directory and run::
ja: ``AdminURLFieldWidget`` にはまだ変更を加えていませんので､テストは落ちます｡ ``model__forms_regress`` フォルダの全テストを走らせて､実際に何が起こるか観てみましょう｡コマンドラインで ``tests/`` ディレクトリに ``cd`` して､以下を実行してください::

source: If the tests ran correctly, you should see three failures corresponding to each of the test methods we added. If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
ja: テストが正しく実行されれば､追加したテストメソッドに対応する3つのテストが失敗するでしょう｡テストがすべて通れば､上記した新しいテストを正しいフォルダ､クラスに追加したことを確認してください｡

source: Writing the code for your ticket
ja: チケットにコードを書く

source: Writing the code for ticket #17549
ja: チケット #17549 にコードを書く

source: Navigate to the ``django/django/contrib/admin/`` folder and open the ``widgets.py`` file. Find the ``AdminURLFieldWidget`` class on line 302 and add the following ``render`` method after the existing ``__init__`` method::
ja: ``django/django/contrib/admin`` フォルダーに行って､ ``widgets.py`` ファイルを開いてください｡ 302行目にある ``AdminURLFieldWidget`` クラスを見つけて､以下の ``render`` メソッドをすでにある ``__init__`` メソッドの下に追加してください::

source: Verifying your test now passes
ja: テストが通ることを確認する

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly. To run the tests in the ``admin_widgets`` folder, ``cd`` into the Django ``tests/`` directory and run::
ja: Django への変更が完了したあと､コードが正しく動作すると確認するため､先ほど書いたテストを実行してください｡Djangoの ``admin_widgets`` フォルダーに ``cd`` で移動して､以下を実行してください::

source: Oops, good thing we wrote those tests! You should still see 3 failures with the following exception::
ja: あぁ､テストを書いていて良かったですね｡以下のように3つテストが落ちています::

source: We forgot to add the import for that method. Go ahead and add the ``smart_urlquote`` import at the end of line 13 of ``django/contrib/admin/widgets.py`` so it looks as follows::
ja: メソッドで使うモジュールのインポートを忘れていました｡ ``smartr_urlquote`` のインポートを ``django/contrib/admin/widgets.py`` の 13 行目の後ろに追加してください｡

source: Re-run the tests and everything should pass. If it doesn't, make sure you correctly modified the ``AdminURLFieldWidget`` class as shown above and copied the new tests correctly.
ja: 再実行すればテストがすべてパスするはずです｡もしそうでない場合､ ``AdminURLFieldWidgt`` クラスと新しいテストが正しくコピーされているされていると確認してください｡

source: Running Django's test suite for the second time
ja: Django の テストスイートをもう一度走らせる

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
ja: パッチとテストが正しく動作していることを確認できたら､ Django のテストをすべて走らせて､変更が Django の別の場所にバグを仕込んでいないか確認しましょう｡すべてのテストが通るという事は､追加したコードがバグフリーだと保証します｡大量のバグや手戻りを発見できます｡そうでないとバグを見逃してしまうでしょう｡

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run::
ja: Django の全てのテストスイートを走らせるには ``cd`` で Django の ``tests/`` ディレクトリ移動して実行してください::

source: As long as you don't see any failures, you're good to go. Note that this fix also made a `small CSS change`__ to format the new widget. You can make the change if you'd like, but we'll skip it for now in the interest of brevity.
ja: テストが失敗しなければ､先に進みましょう｡このチケットでは `少し CSS を変更`__ して新しいウィジェットをフォーマットします｡もしやりたいならやってもいいですが､ここでは省略します｡

source: Writing Documentation
ja: ドキュメントを書く

source: This is a new feature, so it should be documented. Add the following on line 925 of ``django/docs/ref/models/fields.txt`` beneath the existing docs for ``URLField``::
ja: この機能は新しいので､ドキュメントに書かれるべきです｡ 以下のコードを ``django/docs/ref/models/fields.txt`` の 925 行目にある ``URLField`` のドキュメントの下に追記してください｡

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see :doc:`/internals/contributing/writing-documentation`. That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
ja: ドキュメントの書き方についてもっと知りたい場合は :doc:`/internals/contributing/writing-documentation` を参照してください｡ここでは､ ``versionadded` の書き方についてや､ ドキュメントのコピーをローカルでビルドしてみて､ HTML をプレビューする方法などが書かれています｡

source: Generating a patch for your changes
ja: 変更のパッチを生成する

source: Now it's time to generate a patch file that can be uploaded to Trac or applied to another copy of Django. To get a look at the content of your patch, run the following command::
ja: Trac にアップロードされたり､他のDjangoに適応されるパッチを作りましょう｡パッチの内容を見るために､以下のコマンドを実行してください::

source: This will display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial.
ja: チュートリアルの初めでチェックアウトした最初のリビジョンと､(修正した) 現在の Django のコピーとの違いを表示します｡

source: Once you're done looking at the patch, hit the ``q`` key to exit back to the command line. If the patch's content looked okay, you can run the following command to save the patch file to your current working directory::
ja: パッチを見終わったら､ ``q`` キーをタイプしたコマンドラインに戻りましょう｡パッチの内容が良さそうなら､以下のコマンドを実行して､現在のワーキングディレクトリにパッチを保存してください｡

source: You should now have a file in the root Django directory called ``17549.diff``. This patch file contains all your changes and should look this:
ja: Django のルートディレクトリに ``17549.diff`` というファイルが作られるでしょう｡このパッチは変更のすべてを含んでおり､このようになります:

source: So what do I do next?
ja: 次はどうしましょうか?

source: Congratulations, you've generated your very first Django patch!
ja: おめでとうございます!

source: Now that you've got that under your belt, you can put those skills to good use by helping to improve Django's codebase.
ja: Django への最初のパッチができました!

source: Generating patches and attaching them to Trac tickets is useful, however, since we are using git - adopting a more :doc:`git oriented workflow </internals/contributing/writing-code/working-with-git>` is recommended.
ja: パッチの書き方を習得したので､ Django のコードベースを改善するためにスキルを活かしましょう｡パッチを生成して､Tracのチケットに貼り付けるのは便利ですが､ git を使っている場合は､ `git ワークフロー </internals/contributing/writing-code/working-with-git>`_ の利用がオススメです｡

source: Since we never committed our changes locally, perform the following to get your git branch back to a good starting point::
ja: 変更をローカルでコミットしなかった場合は､ git のブランチを始めに戻すために以下を実行してください::

source: More information for new contributors
ja: 新しい貢献者のための情報

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
ja: Django へのパッチを書き始める前に､貢献するために見ておいたほうがいい情報があります:

source: You should make sure to read Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`. It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
ja: Django のドキュメントの `チケットをクレームして､パッチを送信する </internals/contributing/writing-code/submitting-patches>`_ を読んでください｡ Trac でのエチケットやチケットをクレームする方法やパッチに適切なコーディングスタイルなど､重要なことを網羅できます｡

source: First time contributors should also read Django's :doc:`documentation for first time contributors</internals/contributing/new-contributors/>`. It has lots of good advice for those of us who are new to helping out with Django.
ja: Django への初めての貢献者は :doc:`初めての貢献者へのドキュメント </internals/contributing/new-contributors/>` を読んでください｡Django に初めて協力する人たちへの良いアドバイスがあります｡

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains a ton of useful information and should be your first source for answering any questions you might have.
ja: 貢献について､より多くの情報を知りたいなら､ :doc:`貢献についての Django のドキュメント </internals/contributing/index>` を参照してください｡そこにはたくさん有用な情報がありまし､質問があれば､このドキュメントが1番役に立ちます｡

source: Finding your first real ticket
ja: 実際にチケットを探してみましょう

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for. Pay special attention to tickets with the "easy pickings" criterion. These tickets are often much simpler in nature and are great for first time contributors. Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
ja: ドキュメントをたくさん読んだ後は､実際のパッチを書けるのでチケットを探してみましょう｡ "easy picking" タグが付いたチケットを見つけてください｡このチケットは大抵はより簡単なものなので､初めての貢献者には適切でしょう｡ Django への貢献に慣れてきたあとは､難しく､複雑なチケットを書き始めれるでしょう｡

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
ja: 今すぐ始めたいなら (責める人はいません！)、 `パッチが必要な簡単なチケット`__ か `パッチに改善が必要な簡単なチケット`__ を見つけましょう。テストを書きなれているなら `テストが必要な簡単なチケット`__ でもよいでしょう。ただ、チケットのクレームに関するガイドラインに従ってください。 Django ドキュメントの :doc:`チケットをクレームしてパッチを送る </internals/contributing/writing-code/submitting-patches>` で記述されています。

source: What's next?
ja: 次は何をしましょうか？

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After uploading a patch or submitting a pull request, be sure to update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See :doc:`/internals/contributing/triaging-tickets` for details.
ja: チケットにパッチが追加されたあとは、別の人間の目でレビューされる必要があります。パッチをアップロードしたりプルリクエストを送信したあとは、チケットのメタデータから "has patch" フラグを設定してください。 "doesn't need tests" や、その他のメタデータはレビューのためにあります。貢献する際にはいつもスクラッチからパッチを書くというわけではありません。既存のパッチをレビューすることをまた素晴らしく役に立つ貢献です。詳細は :doc:`/internals/contributing/triaging-tickets` を参照してください。

source: Getting started
ja: さぁ始めましょう。

source: New to Django?
ja: Django は初めてですか?

source: Or to Web development in general?
ja: もしくは Web 開発全般で?

source: Well, you came to the right place: read this material to quickly get up and running.
ja: なら、ここに来て正解ですね。ここにあるドキュメントを読んで、行動に移してみましょう。

source: If you're new to Python_, you might want to start by getting an idea of what the language is like. Django is 100% Python, so if you've got minimal comfort with Python you'll probably get a lot more out of Django.
ja: Python_ の初心者なら、まず Python がどんなものかを知ることから始めましょう。 Django は 100% Python です。 ほんの最小限 Python を理解するだけで Django をより深く理解できます。

source: If you're new to programming entirely, you might want to start with this `list of Python resources for non-programmers`_
ja: プログラミング全般の初心者なら、 `非プログラマのための Python リソース一覧`_ から始めてみるとよいでしょう。

source: Quick install guide
ja: クイックインストールガイド

source: Before you can use Django, you'll need to get it installed.
ja: Django を使う前に、インストールをする必要があります。

source: We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
ja: Django にはできることをすべてカバーした :doc:`インストールガイド </topics/install>` があります。これはシンプルでミニマルなインストールガイドで、 Django の導入部分までが説明されています。

source: Install Python
ja: Python をインストールする

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps. See :doc:`/howto/jython` for details.
ja: もし Jython_ (Python のJava プラットフォーム実装) を使っている場合は、いくつか追加のステップを実行する必要があります。詳細は :doc:`/howto/jython` を見てください。

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
ja: Python がインストールされてるかを確かめるには ``python`` とシェルでタイプします。このように表示されるはずです::

source: Set up a database
ja: データベースを設定する

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle. To install such a database, consult the :ref:`database installation information <database-installation>`.
ja: このステップはあなたが "大きな" データベースエンジン、 PostgreSQL 、 MySQL や Oracle を使っている場合に必要です。これらのデータベースをインストールするには、 :ref:`データベースのインストール方法 <database-installation>` を参照してください。

source: Remove any old versions of Django
ja: 古いバージョンの Django を削除する

source: If you are upgrading your installation of Django from a previous version, you will need to :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`.
ja: 前バージョンの Django をアップグレードするには、 :ref:`新しい Django をインストールする前に、古いバージョンの Django をアンインストールする <removing-old-versions-of-django>` 必要があります。

source: Install Django
ja: Django をインストールする

source: You've got three easy options to install Django:
ja: Django をインストールするには 3 つの方法があります:

source: Install a version of Django :doc:`provided by your operating system distribution </misc/distributions>`.
ja: :doc:`OSディストリビューションに提供される </misc/distributions>` Django のバージョンをインストールします。

source: This is the quickest option for those who have operating systems that distribute Django.
ja: Django を配布している OS を使っている人には最速の方法です。

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**. That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
ja: 初め 2 ステップのどちらかをした場合は、ドキュメントの **new in development version** とマークされた部分に気をつけてください。このフレーズは Django の開発版でのみ利用可能な機能であると意味しており、公式リリースではおそらく動作しません。

source: Verifying
ja: 動作確認

source: To verify that Django can be seen by Python, type ``python`` from your shell. Then at the Python prompt, try to import Django:
ja: Djnago が Python から見れるか確認をするには、シェルで ``python`` とタイプして、 Python プロンプトから Django をインポートします:

source: You may have another version of Django installed.
ja: 別バージョンの Django がインストールされてるかもしれません。

source: That's it!
ja: これだけです!

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
ja: これだけです。 `チュートリアルに進みましょう </intro/tutorial01>` 。

source: Django at a glance
ja: Django の概要

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
ja: Django は変転の激しいニュースルーム環境で開発された経緯から、よくある Web 開発タスクを迅速かつ簡単化するように設計されました。ここでは Django による データベース中心の Web アプリケーション開発をざっと見てみましょう。

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both!
ja: このドキュメントの目的は、 Django の技術的な仕様について述べ、どのように動 作するかを理解してもらうことにあり、チュートリアルやリファレンス用ではあり ません。

source: When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
ja: (とはいえ、チュートリアルもリファレンスも別に用意していますよ！) プロジェクトを作成する準備ができたら、 :doc:`チュートリアルを始めれます </intro/tutorial01>` 。もしくは :doc:`より詳細なドキュメントを読む </topics/index>` こともできます。

source: Design your model
ja: モデルの設計

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
ja: データベースなしで Django を使うこともできますが、 Django には Python コードでデータベースのレイアウトを記述した `オブジェクトリレーショナルマッパー`_ (object-relational mapper) が付属しています。

source: Install it
ja: モデルのインストール

source: Next, run the Django command-line utility to create the database tables automatically:
ja: 次に、データベーステーブルを自動でつくる Django のコマンドラインユーティリティを実行します:

source: Enjoy the free API
ja: 自動生成される API で楽しむ

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary:
ja: これだけで、制約のない充実した :doc:`Python API </topics/db/queries>` を使っ て自分のデータにアクセスできます。API はオンザフライで生成され、コードを作 成する必要はありません:

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
ja: 作業場 (scaffold) ではなく完成品 (whole house) の、動的な admin インタフェース

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
ja: サイトの編集はスタッフ、顧客、もしくはあなた自身の手で行われるものであり、 コンテンツの管理だけのためにバックエンドインタフェースを作りたくはない、という思想がここにはあります。

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
ja: 作者たちが Django アプリケーションを作成するときの典型的なワークフローは、 モデルを作成し、 admin サイトを組み上げてできるだけ早期に立ち上げ、スタッフ (や顧客) がデータを投入できるようにしておいてから、データを公開するための方法を開発してゆくというものです。

source: Design your URLs
ja: URL を設計する

source: A clean, elegant URL scheme is an important detail in a high-quality Web application.
ja: すっきりとして洗練された URL スキームは、高品質な Web アプリケーションを実 現する上で重要な要素です。

source: Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
ja: Django は美しい URL の設計を助け、 ``.php`` や ``.asp`` のようなお粗末なゴミを URL に入れさせません。

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`.
ja: 特定のアプリケーション用の URL を設計するには、 `URLconf </topics/http/urls>` と呼ばれる Python モジュールを一つ作成します。

source: A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions.
ja: URLconf はいわばアプリケーションの目次にあたり、 URL のパターンを Python のコールバック関数に対応づけています。

source: URLconfs also serve to decouple URLs from Python code.
ja: URLconf はまた、 URL と Python コードを脱カップ リングする働きも持っています。

source: The code above maps URLs, as simple `regular expressions`_, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
ja: 上のコードはシンプルな `正規表現`_ と Python のコールバック関数("ビュー")をマッピングしています。正規表現は、 URL から値を取得するために括弧を用います。ユーザがページを要求すると、 Django はそれぞれのパターンを順番にチェックし、要求された URL に最初に一致したパターンで停止します。(もしそれらのどれとも一致しなかった時、 Django は特殊ケースである404ビューを呼び出します。)正規表現はロード時にコンパイルされるため、これらは非常に高速に動作します。

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
ja: 一度正規表現が一致すると、 Django は Python の関数であるビュー (view) をインポートし呼び出します。各ビューは、リクエストのメタデータを含むリクエストオブジェクトと、正規表現でキャプチャされた値を受け取ります。
